# Lego Analysis

With reference to a [video](https://www.youtube.com/watch?v=BzQDi4D0B_M&list=PLFCB5Dp81iNVmuoGIqcT5oF4K-7kTI5vp&index=22) by [Keith Gally](https://www.youtube.com/@KeithGalli).

## Problem Statements
1. What percentage of licensed sets ever released were Star Wars themed? (As an integer value)
2. In which year was Star Wars not the most popular licensed theme? (in terms of number of sets released that year)

Null values in column 'num_parts' are acceptable.

## Data

In [1]:
import pandas as pd
parent_themes = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/lego-analysis/master/datasets/parent_themes.csv')
themes = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/lego-analysis/master/datasets/themes.csv')
lego_sets = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/lego-analysis/master/datasets/lego_sets.csv')
sets = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/lego-analysis/master/datasets/sets.csv')

**Lets look a the data sets**

In [3]:
parent_themes.head(2)

   id     name  is_licensed
0   1  Technic        False
1  22  Creator        False

In [4]:
themes.head(2)

   id            name  parent_id
0   1         Technic        NaN
1   2  Arctic Technic        1.0

In [5]:
lego_sets.head(2)

  set_num               name  year  num_parts    theme_name parent_theme
0    00-1    Weetabix Castle  1970      471.0        Castle     Legoland
1  0011-2  Town Mini-Figures  1978        NaN  Supplemental         Town

In [6]:
sets.head(2)

  set_num               name  year  theme_id  num_parts
0    00-1    Weetabix Castle  1970       414        471
1  0011-2  Town Mini-Figures  1978        84         12

### Task 1: Get list of licensed parent themes

In [7]:
licensed_list = parent_themes[parent_themes['is_licensed']==True]['name'].to_list()
licensed_list

['Star Wars',
 'Harry Potter',
 'Pirates of the Caribbean',
 'Indiana Jones',
 'Cars',
 'Ben 10',
 'Prince of Persia',
 'SpongeBob SquarePants',
 'Toy Story',
 'Avatar',
 "Disney's Mickey Mouse",
 'Super Heroes',
 'The Hobbit and Lord of the Rings',
 'Teenage Mutant Ninja Turtles',
 'The Lone Ranger',
 'Minecraft',
 'Disney Princess',
 'Jurassic World',
 'Scooby-Doo',
 'Angry Birds',
 'Ghostbusters',
 'Disney']

### Task 2: Merge 'lego_sets' and 'sets'

In [15]:
lego_merged = pd.merge(lego_sets, sets, left_on='set_num', right_on='set_num')
lego_merged.head(2)

,set_num,name_x,year_x,num_parts_x,theme_name,parent_theme,name_y,year_y,theme_id,num_parts_y
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,Weetabix Castle,1970,414,471
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town,Town Mini-Figures,1978,84,12

**Remove unnecessary columns and rename some columns**

In [16]:
lego_merged.drop(['name_y','year_y','num_parts_y'], axis=1, inplace = True)
lego_merged.rename(columns = {'name_x':'name', 'year_x':'year', 'num_parts_x':'num_parts'}, inplace = True)
lego_merged.head(2)

,set_num,name,year,num_parts,theme_name,parent_theme,theme_id
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,414
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town,84

**Drop NaN values (for column set_num)**

In [17]:
lego_merged.dropna(subset = ['set_num'])

,set_num,name,year,num_parts,theme_name,parent_theme,theme_id
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,414
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town,84
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle,199
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space,143
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space,143
...,...,...,...,...,...,...,...
11828,Wauwatosa-1,"LEGO Store Grand Opening Exclusive Set, Mayfai...",2012,15.0,LEGO Brand Store,LEGO Brand Store,408
11829,WHITEHOUSE-1,Micro White House,2015,NaN,Promotional,Promotional,598
11830,Wiesbaden-1,"LEGO Store Grand Opening Exclusive Set, Wiesba...",2010,146.0,LEGO Brand Store,LEGO Brand Store,408
11831,WishingWell-1,Wishing Well [Toys R Us Promo],2013,NaN,Friends,Friends,494
11832,wwgp1-1,Wild West Limited Edition Gift Pack,1996,NaN,Cowboys,Western,476

**Create a data set that only contains licensed parent themes**

In [19]:
lego_licensed = lego_merged.loc[lego_merged['parent_theme'].isin(licensed_list)]

**What percentage of licensed sets ever released were Star Wars themed? (As an integer value)**

In [21]:
percent = int(lego_licensed[lego_licensed['parent_theme'] == 'Star Wars'].shape[0]/lego_licensed.shape[0]*100)
print(f"The percentage of licensed sets that are Star Wars themed are {percent} percent.")

The percentage of licensed sets that are Star Wars themed are 51 percent.

**In which year was Star Wars not the most popular licensed theme? (in terms of number of sets released that year)**

In [23]:
grouped = lego_licensed.groupby(['year','parent_theme']).size().reset_index(name = 'total_sets')
grouped.head()

   year           parent_theme  total_sets
0  1999              Star Wars          13
1  2000  Disney's Mickey Mouse           5
2  2000              Star Wars          26
3  2001           Harry Potter          11
4  2001              Star Wars          14

Sort the grouped data set and drop year duplicate.

In [28]:
max_sets = grouped.sort_values('total_sets', ascending = False).drop_duplicates('year')
max_sets

    year  parent_theme  total_sets
82  2017  Super Heroes          72
76  2016     Star Wars          61
67  2015     Star Wars          58
59  2014     Star Wars          45
47  2012     Star Wars          43
32  2009     Star Wars          39
52  2013     Star Wars          35
9   2003     Star Wars          32
42  2011     Star Wars          32
36  2010     Star Wars          30
16  2005     Star Wars          28
6   2002     Star Wars          28
2   2000     Star Wars          26
28  2008     Star Wars          23
12  2004     Star Wars          20
24  2007     Star Wars          16
4   2001     Star Wars          14
0   1999     Star Wars          13
20  2006     Star Wars          11

Keep only values for which parent_theme is not Star Wars.

In [40]:
not_sw = max_sets[max_sets['parent_theme'] != 'Star Wars']

for index, row in not_sw.iterrows():
    year = row['year']
    theme = row['parent_theme']
    print(f"Star Wars was not the most popular licensed theme (in terms of number of sets released that year) in year {year}. Instead, it was {theme}.")

Star Wars was not the most popular licensed theme (in terms of number of sets released that year) in year 2017. Instead, it was Super Heroes.